Revit 2016 API
Form Properties
The Form type exposes the following members.
Properties
Name | Description
AreProfilesConstrained
Get/set if the form's profiles are constrained.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BaseOffset
Retrieve/set the base offset of the form object. It is only valid for locked form.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
Combinations
The geometry combinations that this element belongs to.
 (Inherited from CombinableElement.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CurveLoopReferencesOnProfile
The curve references in certain curve loop, specified by profile index and curve loop index.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasOneOrMoreReferenceProfiles
Tell if the form has any reference profile.
HasOpenGeometry
Tell if the form has an open geometry.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsInXRayMode
Get/set if the form is in X-Ray mode.
IsSolid
Identifies if the GenericForm is a solid or a void element.
 (Inherited from GenericForm.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Get and Set the Name property
 (Inherited from GenericForm.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PathCurveCount
The number of curves in the form path.
PathCurveReference
The curve reference in the path, specified by curve index.
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
ProfileCount
The number of profiles in the form.
ProfileCurveLoopCount
The number of curve loops in certain profile, specified by profile index.
Subcategory
The subcategory.
 (Inherited from GenericForm.)
TopOffset
Retrieve/set the top offset of the form object. It is only valid for locked form.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Visible
The visibility of the GenericForm.
 (Inherited from GenericForm.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Form Class
Autodesk.Revit.DB Namespace